avr-rust/avrd/packs/xmegaa/ATxmega128A3.atdf
        <register caption="Power Reduction Port C" name="PRPC" offset="0x03" size="1">
          <bitfield caption="Port C Two-wire Interface" mask="0x40" name="TWI"/>
          <bitfield caption="Port C USART1" mask="0x20" name="USART1"/>
          <bitfield caption="Port C USART0" mask="0x10" name="USART0"/>
          <bitfield caption="Port C SPI" mask="0x08" name="SPI"/>
          <bitfield caption="Port C AWEX" mask="0x04" name="HIRES"/>
          <bitfield caption="Port C Timer/Counter1" mask="0x02" name="TC1"/>
          <bitfield caption="Port C Timer/Counter0" mask="0x01" name="TC0"/>
        </register>
        <register caption="Power Reduction Port D" name="PRPD" offset="0x04" size="1">
          <bitfield caption="Port D Two-wire Interface" mask="0x40" name="TWI"/>
          <bitfield caption="Port D USART1" mask="0x20" name="USART1"/>
          <bitfield caption="Port D USART0" mask="0x10" name="USART0"/>
          <bitfield caption="Port D SPI" mask="0x08" name="SPI"/>
          <bitfield caption="Port D AWEX" mask="0x04" name="HIRES"/>
          <bitfield caption="Port D Timer/Counter1" mask="0x02" name="TC1"/>
          <bitfield caption="Port D Timer/Counter0" mask="0x01" name="TC0"/>
        </register>
        <register caption="Power Reduction Port E" name="PRPE" offset="0x05" size="1">
          <bitfield caption="Port E Two-wire Interface" mask="0x40" name="TWI"/>
          <bitfield caption="Port E USART1" mask="0x20" name="USART1"/>
          <bitfield caption="Port E USART0" mask="0x10" name="USART0"/>
          <bitfield caption="Port E SPI" mask="0x08" name="SPI"/>
          <bitfield caption="Port E AWEX" mask="0x04" name="HIRES"/>
          <bitfield caption="Port E Timer/Counter1" mask="0x02" name="TC1"/>
          <bitfield caption="Port E Timer/Counter0" mask="0x01" name="TC0"/>
        </register>
        <register caption="Power Reduction Port F" name="PRPF" offset="0x06" size="1">
          <bitfield caption="Port F Two-wire Interface" mask="0x40" name="TWI"/>
          <bitfield caption="Port F USART1" mask="0x20" name="USART1"/>
          <bitfield caption="Port F USART0" mask="0x10" name="USART0"/>
          <bitfield caption="Port F SPI" mask="0x08" name="SPI"/>
          <bitfield caption="Port F AWEX" mask="0x04" name="HIRES"/>
          <bitfield caption="Port F Timer/Counter1" mask="0x02" name="TC1"/>
          <bitfield caption="Port F Timer/Counter0" mask="0x01" name="TC0"/>
        </register>
      </register-group>
      <value-group caption="System Clock Selection" name="CLK_SCLKSEL">
        <value caption="Internal 2MHz RC Oscillator" name="RC2M" value="0x00"/>
        <value caption="Internal 32MHz RC Oscillator" name="RC32M" value="0x01"/>
        <value caption="Internal 32kHz RC Oscillator" name="RC32K" value="0x02"/>
        <value caption="External Crystal Oscillator or Clock" name="XOSC" value="0x03"/>
        <value caption="Phase Locked Loop" name="PLL" value="0x04"/>
      </value-group>
      <value-group caption="Prescaler A Division Factor" name="CLK_PSADIV">
        <value caption="Divide by 1" name="1" value="0x00"/>
        <value caption="Divide by 2" name="2" value="0x01"/>
        <value caption="Divide by 4" name="4" value="0x03"/>
        <value caption="Divide by 8" name="8" value="0x05"/>
        <value caption="Divide by 16" name="16" value="0x07"/>
        <value caption="Divide by 32" name="32" value="0x09"/>
        <value caption="Divide by 64" name="64" value="0x0B"/>
        <value caption="Divide by 128" name="128" value="0x0D"/>
        <value caption="Divide by 256" name="256" value="0x0F"/>
        <value caption="Divide by 512" name="512" value="0x11"/>
      </value-group>
      <value-group caption="Prescaler B and C Division Factor" name="CLK_PSBCDIV">
        <value caption="Divide B by 1 and C by 1" name="1_1" value="0x00"/>
        <value caption="Divide B by 1 and C by 2" name="1_2" value="0x01"/>
        <value caption="Divide B by 4 and C by 1" name="4_1" value="0x02"/>
        <value caption="Divide B by 2 and C by 2" name="2_2" value="0x03"/>
      </value-group>
      <value-group caption="RTC Clock Source" name="CLK_RTCSRC">
        <value caption="1kHz from internal 32kHz ULP" name="ULP" value="0x00"/>
        <value caption="1kHz from 32kHz crystal oscillator on TOSC" name="TOSC" value="0x01"/>
        <value caption="1kHz from internal 32kHz RC oscillator" name="RCOSC" value="0x02"/>
        <value caption="32kHz from 32kHz crystal oscillator on TOSC" name="TOSC32" value="0x05"/>
      </value-group>
    </module><module name="SLEEP" id="I6081" caption="Sleep Controller">
      <register-group caption="Sleep Controller" name="SLEEP" size="1">
        <register caption="Control Register" name="CTRL" offset="0x00" size="1">
          <bitfield caption="Sleep Mode" mask="0x0E" name="SMODE" values="SLEEP_SMODE"/>
          <bitfield caption="Sleep Enable" mask="0x01" name="SEN"/>
        </register>
      </register-group>
      <value-group caption="Sleep Mode" name="SLEEP_SMODE">
        <value caption="Idle mode" name="IDLE" value="0x00"/>
        <value caption="Power-down Mode" name="PDOWN" value="0x02"/>
        <value caption="Power-save Mode" name="PSAVE" value="0x03"/>
        <value caption="Standby Mode" name="STDBY" value="0x06"/>
        <value caption="Extended Standby Mode" name="ESTDBY" value="0x07"/>
      </value-group>
    </module><module name="OSC" id="I6079" caption="Oscillator">
      <register-group caption="Oscillator" name="OSC" size="7">
        <register caption="Control Register" name="CTRL" offset="0x00" size="1">
          <bitfield caption="PLL Enable" mask="0x10" name="PLLEN"/>
          <bitfield caption="External Oscillator Enable" mask="0x08" name="XOSCEN"/>
          <bitfield caption="Internal 32kHz RC Oscillator Enable" mask="0x04" name="RC32KEN"/>
          <bitfield caption="Internal 32MHz RC Oscillator Enable" mask="0x02" name="RC32MEN"/>
          <bitfield caption="Internal 2MHz RC Oscillator Enable" mask="0x01" name="RC2MEN"/>
        </register>
        <register caption="Status Register" name="STATUS" offset="0x01" size="1">
          <bitfield caption="PLL Ready" mask="0x10" name="PLLRDY"/>
          <bitfield caption="External Oscillator Ready" mask="0x08" name="XOSCRDY"/>
          <bitfield caption="Internal 32kHz RC Oscillator Ready" mask="0x04" name="RC32KRDY"/>
          <bitfield caption="Internal 32MHz RC Oscillator Ready" mask="0x02" name="RC32MRDY"/>
          <bitfield caption="Internal 2MHz RC Oscillator Ready" mask="0x01" name="RC2MRDY"/>
        </register>
        <register caption="External Oscillator Control Register" name="XOSCCTRL" offset="0x02" size="1">
          <bitfield caption="Frequency Range" mask="0xC0" name="FRQRANGE" values="OSC_FRQRANGE"/>
          <bitfield caption="32kHz XTAL OSC Low-power Mode" mask="0x20" name="X32KLPM"/>
          <bitfield caption="External Oscillator Selection and Startup Time" mask="0x0F" name="XOSCSEL" values="OSC_XOSCSEL"/>
        </register>
        <register caption="External Oscillator Failure Detection Register" name="XOSCFAIL" offset="0x03" size="1">
          <bitfield caption="Failure Detection Interrupt Flag" mask="0x02" name="XOSCFDIF"/>
          <bitfield caption="Failure Detection Enable" mask="0x01" name="XOSCFDEN"/>
        </register>
        <register caption="32kHz Internal Oscillator Calibration Register" name="RC32KCAL" offset="0x04" size="1"/>
